**Import numpy and pandas.
Create df from dictionary**

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Create dataframe
data = {'Company':['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [3]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0  GOOGLE      Sam    200
1  GOOGLE  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

**GROUPBY - mean, max, describe, transpose, unique, value_counts , apply**

In [4]:
dfgrp =df.groupby('Company')

In [5]:
dfgrp.mean()

         Sales
Company
FB       296.5
GOOGLE   160.0
MSFT     232.0

In [6]:
dfgrp.max()

          Person  Sales
Company
FB         Sarah    350
GOOGLE       Sam    200
MSFT     Vanessa    340

In [7]:
dfgrp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [8]:
dfgrp.describe().transpose()

Company              FB      GOOGLE        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [9]:
dfgrp.describe().transpose()['GOOGLE']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOGLE, dtype: float64

In [10]:
df

  Company   Person  Sales
0  GOOGLE      Sam    200
1  GOOGLE  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [11]:
df['Company'].unique()

array(['GOOGLE', 'MSFT', 'FB'], dtype=object)

In [12]:
df.Company.value_counts()

GOOGLE    2
MSFT      2
FB        2
Name: Company, dtype: int64

In [13]:
df['Person'].value_counts()

Vanessa    1
Charlie    1
Sam        1
Amy        1
Sarah      1
Carl       1
Name: Person, dtype: int64

In [15]:
def multiply2(x):
    return x**2

In [16]:
df.Sales.apply(multiply2)

0     40000
1     14400
2    115600
3     15376
4     59049
5    122500
Name: Sales, dtype: int64

In [17]:
df.Person.apply(len)

0    3
1    7
2    3
3    7
4    4
5    5
Name: Person, dtype: int64